# Pandas - Basic Operations

### DataFrame - deep copy

In [1]:
import pandas as pd

In [2]:
dict = {'A' : [1 ,2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
df1 = pd.DataFrame(dict)
df1

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [3]:
df2 = df1.copy() # deep copy is the default option
df2

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [4]:
df2.drop(0, inplace=True)

In [5]:
df2

   A  B  NUM
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [6]:
df1

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

### DataFrame - shallow copy

In [7]:
df3 = df1.copy(deep = False) # 
df3

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

### Get column list

In [8]:
df3

   A  B  NUM
0  1  a    0
1  2  b    0
2  3  c    0
3  4  d    0
4  5  e    0

In [9]:
df3.columns

Index(['A', 'B', 'NUM'], dtype='object')

In [10]:
df3.columns.to_list()

['A', 'B', 'NUM']

### Add a new column

In [4]:
dictx = {'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
dfx = pd.DataFrame(dictx)
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

#### Add new column at the end

In [7]:
# with the same value in each row
dfx['X'] = 'X'
dfx

   A  B  NUM  X  ID
0  1  a    0  X   0
1  1  a    0  X   1
2  3  c    0  X   2
3  4  d    0  X   3
4  5  e    0  X   4

#### Add new column at a specific position

In [9]:
dfx.insert(2, 'NEW_X', [10, 20, 30, 40, 50])
dfx

   A  B  NEW_X  NUM  X  ID
0  1  a     10    0  X   0
1  1  a     20    0  X   1
2  3  c     30    0  X   2
3  4  d     40    0  X   3
4  5  e     50    0  X   4

In [8]:
# with an incremental values in each row
dfx['ID'] = range(len(dfx)) 
dfx

   A  B  NUM  X  ID
0  1  a    0  X   0
1  1  a    0  X   1
2  3  c    0  X   2
3  4  d    0  X   3
4  5  e    0  X   4

#### Using assign method

In [23]:
dfxr1 = dfx.assign(row_number=range(1,len(dfx)+1)) # the new column will be called 'row_number'
dfxr1

   A  B  NUM  row_number
0  1  a    0           1
1  1  a    0           2
2  3  c    0           3
3  4  d    0           4
4  5  e    0           5

In [22]:
dictx = {'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
dfx = pd.DataFrame(dictx)
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

In [9]:
dfx_grupped = dfx.groupby(['A', 'B', 'NUM']).size().reset_index() #.rename(columns={0:'count'})
dfx_grupped

   A  B  NUM  0
0  1  a    0  2
1  3  c    0  1
2  4  d    0  1
3  5  e    0  1

### Remove row

In [10]:
dictx = {'A' : [1 ,1, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'e'], 'NUM': [0, 0, 0, 0, 0 ]}
dfx = pd.DataFrame(dictx)
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

#### Drop row by index number

In [13]:
dfx.drop(1) # drops the second record but does not modify current dataframe

   A  B  NUM
0  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

In [14]:
dfx

   A  B  NUM
0  1  a    0
1  1  a    0
2  3  c    0
3  4  d    0
4  5  e    0

In [17]:
dfx.drop([1,2]) # drop multiple rows

   A  B  NUM
0  1  a    0
3  4  d    0
4  5  e    0

#### Drop by condition

In [18]:
 dfx.drop(dfx[dfx.A <= 3].index)

   A  B  NUM
3  4  d    0
4  5  e    0